---
kind: method
id: M:Autodesk.Revit.DB.SolidGeometryOptions.#ctor(System.Int32)
source: html/0333750f-a64b-07f4-aa32-99b5f61f9008.htm
---
# Autodesk.Revit.DB.SolidGeometryOptions.#ctor Method

Creates a new SolidOptions class with solid tag settings.

## Syntax (C#)
```csharp
public SolidGeometryOptions(
	int solidTag
)
```

## Parameters
- **solidTag** (`System.Int32`) - The material id for the Solid.